{
	"nodes":[
		{"op":"null","name":"Input","attrs":{},"inputs":[]},
		{"op":"null","name":"conv1_7x7_s2.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"conv1_7x7_s2.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"conv1_7x7_s2","attrs":{"num_filter":"64","kernel":"(7, 7)","dilate":"(1, 1)","pad":"(3, 3)","stride":"(2, 2)","num_group":"1","no_bias":"False"},"inputs":[[0,0,0],[1,0,0],[2,0,0]]},
		{"op":"relu","name":"conv1_relu_7x7$0","attrs":{},"inputs":[[3,0,0]]},
		{"op":"Pad","name":"pool1_3x3_s2_pad$0","attrs":{"pad_width":"(0, 0, 0, 0, 0, 1, 0, 1)","mode":"edge","constant_value":"0."},"inputs":[[4,0,0]]},
		{"op":"Pooling","name":"pool1_3x3_s2","attrs":{"kernel":"(3, 3)","pad":"(0, 0)","stride":"(2, 2)","pool_type":"max","global_pool":"False","pooling_convention":"valid"},"inputs":[[5,0,0]]},
		{"op":"LRN","name":"pool1_norm1","attrs":{"alpha":"0.1e-3","beta":"0.75e0","knorm":"0.1e1","nsize":"5"},"inputs":[[6,0,0]]},
		{"op":"null","name":"conv2_3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"conv2_3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"conv2_3x3_reduce","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[7,0,0],[8,0,0],[9,0,0]]},
		{"op":"relu","name":"conv2_relu_3x3_reduce$0","attrs":{},"inputs":[[10,0,0]]},
		{"op":"null","name":"conv2_3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"conv2_3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"conv2_3x3","attrs":{"num_filter":"192","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[11,0,0],[12,0,0],[13,0,0]]},
		{"op":"relu","name":"conv2_relu_3x3$0","attrs":{},"inputs":[[14,0,0]]},
		{"op":"LRN","name":"conv2_norm2","attrs":{"alpha":"0.1e-3","beta":"0.75e0","knorm":"0.1e1","nsize":"5"},"inputs":[[15,0,0]]},
		{"op":"Pad","name":"pool2_3x3_s2_pad$0","attrs":{"pad_width":"(0, 0, 0, 0, 0, 1, 0, 1)","mode":"edge","constant_value":"0."},"inputs":[[16,0,0]]},
		{"op":"Pooling","name":"pool2_3x3_s2","attrs":{"kernel":"(3, 3)","pad":"(0, 0)","stride":"(2, 2)","pool_type":"max","global_pool":"False","pooling_convention":"valid"},"inputs":[[17,0,0]]},
		{"op":"null","name":"inception_3a.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3a.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3a.1x1","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[18,0,0],[19,0,0],[20,0,0]]},
		{"op":"relu","name":"inception_3a.relu_1x1$0","attrs":{},"inputs":[[21,0,0]]},
		{"op":"null","name":"inception_3a.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3a.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3a.3x3_reduce","attrs":{"num_filter":"96","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[18,0,0],[23,0,0],[24,0,0]]},
		{"op":"relu","name":"inception_3a.relu_3x3_reduce$0","attrs":{},"inputs":[[25,0,0]]},
		{"op":"null","name":"inception_3a.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3a.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3a.3x3","attrs":{"num_filter":"128","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[26,0,0],[27,0,0],[28,0,0]]},
		{"op":"relu","name":"inception_3a.relu_3x3$0","attrs":{},"inputs":[[29,0,0]]},
		{"op":"null","name":"inception_3a.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3a.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3a.5x5_reduce","attrs":{"num_filter":"16","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[18,0,0],[31,0,0],[32,0,0]]},
		{"op":"relu","name":"inception_3a.relu_5x5_reduce$0","attrs":{},"inputs":[[33,0,0]]},
		{"op":"null","name":"inception_3a.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3a.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3a.5x5","attrs":{"num_filter":"32","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[34,0,0],[35,0,0],[36,0,0]]},
		{"op":"relu","name":"inception_3a.relu_5x5$0","attrs":{},"inputs":[[37,0,0]]},
		{"op":"Pooling","name":"inception_3a.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[18,0,0]]},
		{"op":"null","name":"inception_3a.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3a.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3a.pool_proj","attrs":{"num_filter":"32","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[39,0,0],[40,0,0],[41,0,0]]},
		{"op":"relu","name":"inception_3a.relu_pool_proj$0","attrs":{},"inputs":[[42,0,0]]},
		{"op":"concat","name":"inception_3a.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[22,0,0],[30,0,0],[38,0,0],[43,0,0]]},
		{"op":"null","name":"inception_3b.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3b.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3b.1x1","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[44,0,0],[45,0,0],[46,0,0]]},
		{"op":"relu","name":"inception_3b.relu_1x1$0","attrs":{},"inputs":[[47,0,0]]},
		{"op":"null","name":"inception_3b.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3b.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3b.3x3_reduce","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[44,0,0],[49,0,0],[50,0,0]]},
		{"op":"relu","name":"inception_3b.relu_3x3_reduce$0","attrs":{},"inputs":[[51,0,0]]},
		{"op":"null","name":"inception_3b.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3b.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3b.3x3","attrs":{"num_filter":"192","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[52,0,0],[53,0,0],[54,0,0]]},
		{"op":"relu","name":"inception_3b.relu_3x3$0","attrs":{},"inputs":[[55,0,0]]},
		{"op":"null","name":"inception_3b.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3b.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3b.5x5_reduce","attrs":{"num_filter":"32","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[44,0,0],[57,0,0],[58,0,0]]},
		{"op":"relu","name":"inception_3b.relu_5x5_reduce$0","attrs":{},"inputs":[[59,0,0]]},
		{"op":"null","name":"inception_3b.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3b.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3b.5x5","attrs":{"num_filter":"96","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[60,0,0],[61,0,0],[62,0,0]]},
		{"op":"relu","name":"inception_3b.relu_5x5$0","attrs":{},"inputs":[[63,0,0]]},
		{"op":"Pooling","name":"inception_3b.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[44,0,0]]},
		{"op":"null","name":"inception_3b.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_3b.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_3b.pool_proj","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[65,0,0],[66,0,0],[67,0,0]]},
		{"op":"relu","name":"inception_3b.relu_pool_proj$0","attrs":{},"inputs":[[68,0,0]]},
		{"op":"concat","name":"inception_3b.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[48,0,0],[56,0,0],[64,0,0],[69,0,0]]},
		{"op":"Pad","name":"pool3_3x3_s2_pad$0","attrs":{"pad_width":"(0, 0, 0, 0, 0, 1, 0, 1)","mode":"edge","constant_value":"0."},"inputs":[[70,0,0]]},
		{"op":"Pooling","name":"pool3_3x3_s2","attrs":{"kernel":"(3, 3)","pad":"(0, 0)","stride":"(2, 2)","pool_type":"max","global_pool":"False","pooling_convention":"valid"},"inputs":[[71,0,0]]},
		{"op":"null","name":"inception_4a.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4a.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4a.1x1","attrs":{"num_filter":"192","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[72,0,0],[73,0,0],[74,0,0]]},
		{"op":"relu","name":"inception_4a.relu_1x1$0","attrs":{},"inputs":[[75,0,0]]},
		{"op":"null","name":"inception_4a.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4a.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4a.3x3_reduce","attrs":{"num_filter":"96","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[72,0,0],[77,0,0],[78,0,0]]},
		{"op":"relu","name":"inception_4a.relu_3x3_reduce$0","attrs":{},"inputs":[[79,0,0]]},
		{"op":"null","name":"inception_4a.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4a.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4a.3x3","attrs":{"num_filter":"208","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[80,0,0],[81,0,0],[82,0,0]]},
		{"op":"relu","name":"inception_4a.relu_3x3$0","attrs":{},"inputs":[[83,0,0]]},
		{"op":"null","name":"inception_4a.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4a.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4a.5x5_reduce","attrs":{"num_filter":"16","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[72,0,0],[85,0,0],[86,0,0]]},
		{"op":"relu","name":"inception_4a.relu_5x5_reduce$0","attrs":{},"inputs":[[87,0,0]]},
		{"op":"null","name":"inception_4a.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4a.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4a.5x5","attrs":{"num_filter":"48","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[88,0,0],[89,0,0],[90,0,0]]},
		{"op":"relu","name":"inception_4a.relu_5x5$0","attrs":{},"inputs":[[91,0,0]]},
		{"op":"Pooling","name":"inception_4a.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[72,0,0]]},
		{"op":"null","name":"inception_4a.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4a.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4a.pool_proj","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[93,0,0],[94,0,0],[95,0,0]]},
		{"op":"relu","name":"inception_4a.relu_pool_proj$0","attrs":{},"inputs":[[96,0,0]]},
		{"op":"concat","name":"inception_4a.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[76,0,0],[84,0,0],[92,0,0],[97,0,0]]},
		{"op":"null","name":"inception_4b.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4b.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4b.1x1","attrs":{"num_filter":"160","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[98,0,0],[99,0,0],[100,0,0]]},
		{"op":"relu","name":"inception_4b.relu_1x1$0","attrs":{},"inputs":[[101,0,0]]},
		{"op":"null","name":"inception_4b.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4b.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4b.3x3_reduce","attrs":{"num_filter":"112","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[98,0,0],[103,0,0],[104,0,0]]},
		{"op":"relu","name":"inception_4b.relu_3x3_reduce$0","attrs":{},"inputs":[[105,0,0]]},
		{"op":"null","name":"inception_4b.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4b.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4b.3x3","attrs":{"num_filter":"224","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[106,0,0],[107,0,0],[108,0,0]]},
		{"op":"relu","name":"inception_4b.relu_3x3$0","attrs":{},"inputs":[[109,0,0]]},
		{"op":"null","name":"inception_4b.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4b.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4b.5x5_reduce","attrs":{"num_filter":"24","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[98,0,0],[111,0,0],[112,0,0]]},
		{"op":"relu","name":"inception_4b.relu_5x5_reduce$0","attrs":{},"inputs":[[113,0,0]]},
		{"op":"null","name":"inception_4b.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4b.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4b.5x5","attrs":{"num_filter":"64","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[114,0,0],[115,0,0],[116,0,0]]},
		{"op":"relu","name":"inception_4b.relu_5x5$0","attrs":{},"inputs":[[117,0,0]]},
		{"op":"Pooling","name":"inception_4b.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[98,0,0]]},
		{"op":"null","name":"inception_4b.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4b.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4b.pool_proj","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[119,0,0],[120,0,0],[121,0,0]]},
		{"op":"relu","name":"inception_4b.relu_pool_proj$0","attrs":{},"inputs":[[122,0,0]]},
		{"op":"concat","name":"inception_4b.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[102,0,0],[110,0,0],[118,0,0],[123,0,0]]},
		{"op":"null","name":"inception_4c.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4c.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4c.1x1","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[124,0,0],[125,0,0],[126,0,0]]},
		{"op":"relu","name":"inception_4c.relu_1x1$0","attrs":{},"inputs":[[127,0,0]]},
		{"op":"null","name":"inception_4c.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4c.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4c.3x3_reduce","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[124,0,0],[129,0,0],[130,0,0]]},
		{"op":"relu","name":"inception_4c.relu_3x3_reduce$0","attrs":{},"inputs":[[131,0,0]]},
		{"op":"null","name":"inception_4c.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4c.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4c.3x3","attrs":{"num_filter":"256","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[132,0,0],[133,0,0],[134,0,0]]},
		{"op":"relu","name":"inception_4c.relu_3x3$0","attrs":{},"inputs":[[135,0,0]]},
		{"op":"null","name":"inception_4c.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4c.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4c.5x5_reduce","attrs":{"num_filter":"24","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[124,0,0],[137,0,0],[138,0,0]]},
		{"op":"relu","name":"inception_4c.relu_5x5_reduce$0","attrs":{},"inputs":[[139,0,0]]},
		{"op":"null","name":"inception_4c.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4c.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4c.5x5","attrs":{"num_filter":"64","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[140,0,0],[141,0,0],[142,0,0]]},
		{"op":"relu","name":"inception_4c.relu_5x5$0","attrs":{},"inputs":[[143,0,0]]},
		{"op":"Pooling","name":"inception_4c.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[124,0,0]]},
		{"op":"null","name":"inception_4c.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4c.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4c.pool_proj","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[145,0,0],[146,0,0],[147,0,0]]},
		{"op":"relu","name":"inception_4c.relu_pool_proj$0","attrs":{},"inputs":[[148,0,0]]},
		{"op":"concat","name":"inception_4c.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[128,0,0],[136,0,0],[144,0,0],[149,0,0]]},
		{"op":"null","name":"inception_4d.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4d.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4d.1x1","attrs":{"num_filter":"112","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[150,0,0],[151,0,0],[152,0,0]]},
		{"op":"relu","name":"inception_4d.relu_1x1$0","attrs":{},"inputs":[[153,0,0]]},
		{"op":"null","name":"inception_4d.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4d.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4d.3x3_reduce","attrs":{"num_filter":"144","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[150,0,0],[155,0,0],[156,0,0]]},
		{"op":"relu","name":"inception_4d.relu_3x3_reduce$0","attrs":{},"inputs":[[157,0,0]]},
		{"op":"null","name":"inception_4d.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4d.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4d.3x3","attrs":{"num_filter":"288","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[158,0,0],[159,0,0],[160,0,0]]},
		{"op":"relu","name":"inception_4d.relu_3x3$0","attrs":{},"inputs":[[161,0,0]]},
		{"op":"null","name":"inception_4d.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4d.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4d.5x5_reduce","attrs":{"num_filter":"32","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[150,0,0],[163,0,0],[164,0,0]]},
		{"op":"relu","name":"inception_4d.relu_5x5_reduce$0","attrs":{},"inputs":[[165,0,0]]},
		{"op":"null","name":"inception_4d.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4d.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4d.5x5","attrs":{"num_filter":"64","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[166,0,0],[167,0,0],[168,0,0]]},
		{"op":"relu","name":"inception_4d.relu_5x5$0","attrs":{},"inputs":[[169,0,0]]},
		{"op":"Pooling","name":"inception_4d.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[150,0,0]]},
		{"op":"null","name":"inception_4d.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4d.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4d.pool_proj","attrs":{"num_filter":"64","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[171,0,0],[172,0,0],[173,0,0]]},
		{"op":"relu","name":"inception_4d.relu_pool_proj$0","attrs":{},"inputs":[[174,0,0]]},
		{"op":"concat","name":"inception_4d.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[154,0,0],[162,0,0],[170,0,0],[175,0,0]]},
		{"op":"null","name":"inception_4e.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4e.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4e.1x1","attrs":{"num_filter":"256","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[176,0,0],[177,0,0],[178,0,0]]},
		{"op":"relu","name":"inception_4e.relu_1x1$0","attrs":{},"inputs":[[179,0,0]]},
		{"op":"null","name":"inception_4e.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4e.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4e.3x3_reduce","attrs":{"num_filter":"160","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[176,0,0],[181,0,0],[182,0,0]]},
		{"op":"relu","name":"inception_4e.relu_3x3_reduce$0","attrs":{},"inputs":[[183,0,0]]},
		{"op":"null","name":"inception_4e.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4e.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4e.3x3","attrs":{"num_filter":"320","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[184,0,0],[185,0,0],[186,0,0]]},
		{"op":"relu","name":"inception_4e.relu_3x3$0","attrs":{},"inputs":[[187,0,0]]},
		{"op":"null","name":"inception_4e.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4e.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4e.5x5_reduce","attrs":{"num_filter":"32","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[176,0,0],[189,0,0],[190,0,0]]},
		{"op":"relu","name":"inception_4e.relu_5x5_reduce$0","attrs":{},"inputs":[[191,0,0]]},
		{"op":"null","name":"inception_4e.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4e.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4e.5x5","attrs":{"num_filter":"128","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[192,0,0],[193,0,0],[194,0,0]]},
		{"op":"relu","name":"inception_4e.relu_5x5$0","attrs":{},"inputs":[[195,0,0]]},
		{"op":"Pooling","name":"inception_4e.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[176,0,0]]},
		{"op":"null","name":"inception_4e.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_4e.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_4e.pool_proj","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[197,0,0],[198,0,0],[199,0,0]]},
		{"op":"relu","name":"inception_4e.relu_pool_proj$0","attrs":{},"inputs":[[200,0,0]]},
		{"op":"concat","name":"inception_4e.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[180,0,0],[188,0,0],[196,0,0],[201,0,0]]},
		{"op":"Pad","name":"pool4_3x3_s2_pad$0","attrs":{"pad_width":"(0, 0, 0, 0, 0, 1, 0, 1)","mode":"edge","constant_value":"0."},"inputs":[[202,0,0]]},
		{"op":"Pooling","name":"pool4_3x3_s2","attrs":{"kernel":"(3, 3)","pad":"(0, 0)","stride":"(2, 2)","pool_type":"max","global_pool":"False","pooling_convention":"valid"},"inputs":[[203,0,0]]},
		{"op":"null","name":"inception_5a.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5a.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5a.1x1","attrs":{"num_filter":"256","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[204,0,0],[205,0,0],[206,0,0]]},
		{"op":"relu","name":"inception_5a.relu_1x1$0","attrs":{},"inputs":[[207,0,0]]},
		{"op":"null","name":"inception_5a.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5a.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5a.3x3_reduce","attrs":{"num_filter":"160","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[204,0,0],[209,0,0],[210,0,0]]},
		{"op":"relu","name":"inception_5a.relu_3x3_reduce$0","attrs":{},"inputs":[[211,0,0]]},
		{"op":"null","name":"inception_5a.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5a.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5a.3x3","attrs":{"num_filter":"320","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[212,0,0],[213,0,0],[214,0,0]]},
		{"op":"relu","name":"inception_5a.relu_3x3$0","attrs":{},"inputs":[[215,0,0]]},
		{"op":"null","name":"inception_5a.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5a.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5a.5x5_reduce","attrs":{"num_filter":"32","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[204,0,0],[217,0,0],[218,0,0]]},
		{"op":"relu","name":"inception_5a.relu_5x5_reduce$0","attrs":{},"inputs":[[219,0,0]]},
		{"op":"null","name":"inception_5a.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5a.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5a.5x5","attrs":{"num_filter":"128","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[220,0,0],[221,0,0],[222,0,0]]},
		{"op":"relu","name":"inception_5a.relu_5x5$0","attrs":{},"inputs":[[223,0,0]]},
		{"op":"Pooling","name":"inception_5a.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[204,0,0]]},
		{"op":"null","name":"inception_5a.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5a.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5a.pool_proj","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[225,0,0],[226,0,0],[227,0,0]]},
		{"op":"relu","name":"inception_5a.relu_pool_proj$0","attrs":{},"inputs":[[228,0,0]]},
		{"op":"concat","name":"inception_5a.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[208,0,0],[216,0,0],[224,0,0],[229,0,0]]},
		{"op":"null","name":"inception_5b.1x1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5b.1x1.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5b.1x1","attrs":{"num_filter":"384","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[230,0,0],[231,0,0],[232,0,0]]},
		{"op":"relu","name":"inception_5b.relu_1x1$0","attrs":{},"inputs":[[233,0,0]]},
		{"op":"null","name":"inception_5b.3x3_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5b.3x3_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5b.3x3_reduce","attrs":{"num_filter":"192","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[230,0,0],[235,0,0],[236,0,0]]},
		{"op":"relu","name":"inception_5b.relu_3x3_reduce$0","attrs":{},"inputs":[[237,0,0]]},
		{"op":"null","name":"inception_5b.3x3.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5b.3x3.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5b.3x3","attrs":{"num_filter":"384","kernel":"(3, 3)","dilate":"(1, 1)","pad":"(1, 1)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[238,0,0],[239,0,0],[240,0,0]]},
		{"op":"relu","name":"inception_5b.relu_3x3$0","attrs":{},"inputs":[[241,0,0]]},
		{"op":"null","name":"inception_5b.5x5_reduce.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5b.5x5_reduce.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5b.5x5_reduce","attrs":{"num_filter":"48","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[230,0,0],[243,0,0],[244,0,0]]},
		{"op":"relu","name":"inception_5b.relu_5x5_reduce$0","attrs":{},"inputs":[[245,0,0]]},
		{"op":"null","name":"inception_5b.5x5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5b.5x5.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5b.5x5","attrs":{"num_filter":"128","kernel":"(5, 5)","dilate":"(1, 1)","pad":"(2, 2)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[246,0,0],[247,0,0],[248,0,0]]},
		{"op":"relu","name":"inception_5b.relu_5x5$0","attrs":{},"inputs":[[249,0,0]]},
		{"op":"Pooling","name":"inception_5b.pool","attrs":{"kernel":"(3, 3)","pad":"(1, 1)","stride":"(1, 1)","pool_type":"max","global_pool":"False","pooling_convention":"full"},"inputs":[[230,0,0]]},
		{"op":"null","name":"inception_5b.pool_proj.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"inception_5b.pool_proj.Biases","attrs":{},"inputs":[]},
		{"op":"Convolution","name":"inception_5b.pool_proj","attrs":{"num_filter":"128","kernel":"(1, 1)","dilate":"(1, 1)","pad":"(0, 0)","stride":"(1, 1)","num_group":"1","no_bias":"False"},"inputs":[[251,0,0],[252,0,0],[253,0,0]]},
		{"op":"relu","name":"inception_5b.relu_pool_proj$0","attrs":{},"inputs":[[254,0,0]]},
		{"op":"concat","name":"inception_5b.output$0","attrs":{"num_args":"4","dim":"1"},"inputs":[[234,0,0],[242,0,0],[250,0,0],[255,0,0]]},
		{"op":"Pooling","name":"pool5_7x7_s1","attrs":{"kernel":"(7, 7)","pad":"(0, 0)","stride":"(1, 1)","pool_type":"avg","global_pool":"False","pooling_convention":"full"},"inputs":[[256,0,0]]},
		{"op":"Dropout","name":"pool5_drop_7x7_s1$0","attrs":{"p":"0.4e0"},"inputs":[[257,0,0]]},
		{"op":"Flatten","name":"flatten_0","attrs":{},"inputs":[[258,0,0]]},
		{"op":"null","name":"loss3_classifier_sos.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"loss3_classifier_sos.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"loss3_classifier_sos","attrs":{"num_hidden":"5","no_bias":"False"},"inputs":[[259,0,0],[260,0,0],[261,0,0]]},
		{"op":"softmax","name":"loss3_loss3$0","attrs":{"axis":"1"},"inputs":[[262,0,0]]},
		{"op":"identity","name":"Output","attrs":{},"inputs":[[263,0,0]]}
	],
	"arg_nodes":[0,1,2,8,9,12,13,19,20,23,24,27,28,31,32,35,36,40,41,45,46,49,50,53,54,57,58,61,62,66,67,73,74,77,78,81,82,85,86,89,90,94,95,99,100,103,104,107,108,111,112,115,116,120,121,125,126,129,130,133,134,137,138,141,142,146,147,151,152,155,156,159,160,163,164,167,168,172,173,177,178,181,182,185,186,189,190,193,194,198,199,205,206,209,210,213,214,217,218,221,222,226,227,231,232,235,236,239,240,243,244,247,248,252,253,260,261],
	"heads":[
		[264,0,0]
	],
	"attrs":{
		"mxnet_version":["int",10001]
	}
}