{
	"nodes":[
		{"op":"null","name":"Input","attrs":{},"inputs":[]},
		{"op":"null","name":"4.State","attrs":{},"inputs":[]},
		{"op":"null","name":"4.CellState","attrs":{},"inputs":[]},
		{"op":"null","name":"1.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.Biases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"1","attrs":{"num_hidden":"10","no_bias":"False"},"inputs":[[0,0,0],[3,0,0],[4,0,0]]},
		{"op":"relu","name":"2$0","attrs":{},"inputs":[[5,0,0]]},
		{"op":"Reshape","name":"3","attrs":{"shape":"(-1, 5, 2)"},"inputs":[[6,0,0]]},
		{"op":"null","name":"4.InputGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.InputGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.InputGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"4.OutputGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.OutputGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.OutputGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"4.ForgetGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.ForgetGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.ForgetGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"4.MemoryGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.MemoryGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"4.MemoryGateBiases","attrs":{},"inputs":[]},
		{"op":"SliceChannel","name":"4$0","attrs":{"axis":"1","num_outputs":"5","squeeze_axis":"true"},"inputs":[[7,0,0]]},
		{"op":"FullyConnected","name":"4$1","attrs":{"num_hidden":"5"},"inputs":[[20,0,0],[8,0,0],[10,0,0]]},
		{"op":"FullyConnected","name":"4$2","attrs":{"num_hidden":"5"},"inputs":[[20,1,0],[8,0,0],[10,0,0]]},
		{"op":"FullyConnected","name":"4$3","attrs":{"num_hidden":"5"},"inputs":[[20,2,0],[8,0,0],[10,0,0]]},
		{"op":"FullyConnected","name":"4$4","attrs":{"num_hidden":"5"},"inputs":[[20,3,0],[8,0,0],[10,0,0]]},
		{"op":"FullyConnected","name":"4$5","attrs":{"num_hidden":"5"},"inputs":[[20,4,0],[8,0,0],[10,0,0]]},
		{"op":"FullyConnected","name":"4$6","attrs":{"num_hidden":"5"},"inputs":[[20,0,0],[11,0,0],[13,0,0]]},
		{"op":"FullyConnected","name":"4$7","attrs":{"num_hidden":"5"},"inputs":[[20,1,0],[11,0,0],[13,0,0]]},
		{"op":"FullyConnected","name":"4$8","attrs":{"num_hidden":"5"},"inputs":[[20,2,0],[11,0,0],[13,0,0]]},
		{"op":"FullyConnected","name":"4$9","attrs":{"num_hidden":"5"},"inputs":[[20,3,0],[11,0,0],[13,0,0]]},
		{"op":"FullyConnected","name":"4$10","attrs":{"num_hidden":"5"},"inputs":[[20,4,0],[11,0,0],[13,0,0]]},
		{"op":"FullyConnected","name":"4$11","attrs":{"num_hidden":"5"},"inputs":[[20,0,0],[14,0,0],[16,0,0]]},
		{"op":"FullyConnected","name":"4$12","attrs":{"num_hidden":"5"},"inputs":[[20,1,0],[14,0,0],[16,0,0]]},
		{"op":"FullyConnected","name":"4$13","attrs":{"num_hidden":"5"},"inputs":[[20,2,0],[14,0,0],[16,0,0]]},
		{"op":"FullyConnected","name":"4$14","attrs":{"num_hidden":"5"},"inputs":[[20,3,0],[14,0,0],[16,0,0]]},
		{"op":"FullyConnected","name":"4$15","attrs":{"num_hidden":"5"},"inputs":[[20,4,0],[14,0,0],[16,0,0]]},
		{"op":"FullyConnected","name":"4$16","attrs":{"num_hidden":"5"},"inputs":[[20,0,0],[17,0,0],[19,0,0]]},
		{"op":"FullyConnected","name":"4$17","attrs":{"num_hidden":"5"},"inputs":[[20,1,0],[17,0,0],[19,0,0]]},
		{"op":"FullyConnected","name":"4$18","attrs":{"num_hidden":"5"},"inputs":[[20,2,0],[17,0,0],[19,0,0]]},
		{"op":"FullyConnected","name":"4$19","attrs":{"num_hidden":"5"},"inputs":[[20,3,0],[17,0,0],[19,0,0]]},
		{"op":"FullyConnected","name":"4$20","attrs":{"num_hidden":"5"},"inputs":[[20,4,0],[17,0,0],[19,0,0]]},
		{"op":"FullyConnected","name":"4$21","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[1,0,0],[9,0,0]]},
		{"op":"_Plus","name":"4$22","attrs":{},"inputs":[[21,0,0],[41,0,0]]},
		{"op":"sigmoid","name":"4$23","attrs":{},"inputs":[[42,0,0]]},
		{"op":"FullyConnected","name":"4$24","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[1,0,0],[12,0,0]]},
		{"op":"_Plus","name":"4$25","attrs":{},"inputs":[[26,0,0],[44,0,0]]},
		{"op":"sigmoid","name":"4$26","attrs":{},"inputs":[[45,0,0]]},
		{"op":"FullyConnected","name":"4$27","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[1,0,0],[15,0,0]]},
		{"op":"_Plus","name":"4$28","attrs":{},"inputs":[[31,0,0],[47,0,0]]},
		{"op":"sigmoid","name":"4$29","attrs":{},"inputs":[[48,0,0]]},
		{"op":"FullyConnected","name":"4$30","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[1,0,0],[18,0,0]]},
		{"op":"_Plus","name":"4$31","attrs":{},"inputs":[[36,0,0],[50,0,0]]},
		{"op":"tanh","name":"4$32","attrs":{},"inputs":[[51,0,0]]},
		{"op":"_Mul","name":"4$33","attrs":{"__force_mirroring__":"True"},"inputs":[[49,0,0],[2,0,0]]},
		{"op":"_Mul","name":"4$34","attrs":{"__force_mirroring__":"True"},"inputs":[[43,0,0],[52,0,0]]},
		{"op":"_Plus","name":"4$35","attrs":{"__force_mirroring__":"True"},"inputs":[[53,0,0],[54,0,0]]},
		{"op":"tanh","name":"4$36","attrs":{"__force_mirroring__":"True"},"inputs":[[55,0,0]]},
		{"op":"_Mul","name":"4$37","attrs":{"__force_mirroring__":"True"},"inputs":[[46,0,0],[56,0,0]]},
		{"op":"FullyConnected","name":"4$38","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[57,0,0],[9,0,0]]},
		{"op":"_Plus","name":"4$39","attrs":{},"inputs":[[22,0,0],[58,0,0]]},
		{"op":"sigmoid","name":"4$40","attrs":{},"inputs":[[59,0,0]]},
		{"op":"FullyConnected","name":"4$41","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[57,0,0],[12,0,0]]},
		{"op":"_Plus","name":"4$42","attrs":{},"inputs":[[27,0,0],[61,0,0]]},
		{"op":"sigmoid","name":"4$43","attrs":{},"inputs":[[62,0,0]]},
		{"op":"FullyConnected","name":"4$44","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[57,0,0],[15,0,0]]},
		{"op":"_Plus","name":"4$45","attrs":{},"inputs":[[32,0,0],[64,0,0]]},
		{"op":"sigmoid","name":"4$46","attrs":{},"inputs":[[65,0,0]]},
		{"op":"FullyConnected","name":"4$47","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[57,0,0],[18,0,0]]},
		{"op":"_Plus","name":"4$48","attrs":{},"inputs":[[37,0,0],[67,0,0]]},
		{"op":"tanh","name":"4$49","attrs":{},"inputs":[[68,0,0]]},
		{"op":"_Mul","name":"4$50","attrs":{"__force_mirroring__":"True"},"inputs":[[66,0,0],[55,0,0]]},
		{"op":"_Mul","name":"4$51","attrs":{"__force_mirroring__":"True"},"inputs":[[60,0,0],[69,0,0]]},
		{"op":"_Plus","name":"4$52","attrs":{"__force_mirroring__":"True"},"inputs":[[70,0,0],[71,0,0]]},
		{"op":"tanh","name":"4$53","attrs":{"__force_mirroring__":"True"},"inputs":[[72,0,0]]},
		{"op":"_Mul","name":"4$54","attrs":{"__force_mirroring__":"True"},"inputs":[[63,0,0],[73,0,0]]},
		{"op":"FullyConnected","name":"4$55","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[74,0,0],[9,0,0]]},
		{"op":"_Plus","name":"4$56","attrs":{},"inputs":[[23,0,0],[75,0,0]]},
		{"op":"sigmoid","name":"4$57","attrs":{},"inputs":[[76,0,0]]},
		{"op":"FullyConnected","name":"4$58","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[74,0,0],[12,0,0]]},
		{"op":"_Plus","name":"4$59","attrs":{},"inputs":[[28,0,0],[78,0,0]]},
		{"op":"sigmoid","name":"4$60","attrs":{},"inputs":[[79,0,0]]},
		{"op":"FullyConnected","name":"4$61","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[74,0,0],[15,0,0]]},
		{"op":"_Plus","name":"4$62","attrs":{},"inputs":[[33,0,0],[81,0,0]]},
		{"op":"sigmoid","name":"4$63","attrs":{},"inputs":[[82,0,0]]},
		{"op":"FullyConnected","name":"4$64","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[74,0,0],[18,0,0]]},
		{"op":"_Plus","name":"4$65","attrs":{},"inputs":[[38,0,0],[84,0,0]]},
		{"op":"tanh","name":"4$66","attrs":{},"inputs":[[85,0,0]]},
		{"op":"_Mul","name":"4$67","attrs":{"__force_mirroring__":"True"},"inputs":[[83,0,0],[72,0,0]]},
		{"op":"_Mul","name":"4$68","attrs":{"__force_mirroring__":"True"},"inputs":[[77,0,0],[86,0,0]]},
		{"op":"_Plus","name":"4$69","attrs":{"__force_mirroring__":"True"},"inputs":[[87,0,0],[88,0,0]]},
		{"op":"tanh","name":"4$70","attrs":{"__force_mirroring__":"True"},"inputs":[[89,0,0]]},
		{"op":"_Mul","name":"4$71","attrs":{"__force_mirroring__":"True"},"inputs":[[80,0,0],[90,0,0]]},
		{"op":"FullyConnected","name":"4$72","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[91,0,0],[9,0,0]]},
		{"op":"_Plus","name":"4$73","attrs":{},"inputs":[[24,0,0],[92,0,0]]},
		{"op":"sigmoid","name":"4$74","attrs":{},"inputs":[[93,0,0]]},
		{"op":"FullyConnected","name":"4$75","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[91,0,0],[12,0,0]]},
		{"op":"_Plus","name":"4$76","attrs":{},"inputs":[[29,0,0],[95,0,0]]},
		{"op":"sigmoid","name":"4$77","attrs":{},"inputs":[[96,0,0]]},
		{"op":"FullyConnected","name":"4$78","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[91,0,0],[15,0,0]]},
		{"op":"_Plus","name":"4$79","attrs":{},"inputs":[[34,0,0],[98,0,0]]},
		{"op":"sigmoid","name":"4$80","attrs":{},"inputs":[[99,0,0]]},
		{"op":"FullyConnected","name":"4$81","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[91,0,0],[18,0,0]]},
		{"op":"_Plus","name":"4$82","attrs":{},"inputs":[[39,0,0],[101,0,0]]},
		{"op":"tanh","name":"4$83","attrs":{},"inputs":[[102,0,0]]},
		{"op":"_Mul","name":"4$84","attrs":{"__force_mirroring__":"True"},"inputs":[[100,0,0],[89,0,0]]},
		{"op":"_Mul","name":"4$85","attrs":{"__force_mirroring__":"True"},"inputs":[[94,0,0],[103,0,0]]},
		{"op":"_Plus","name":"4$86","attrs":{"__force_mirroring__":"True"},"inputs":[[104,0,0],[105,0,0]]},
		{"op":"tanh","name":"4$87","attrs":{"__force_mirroring__":"True"},"inputs":[[106,0,0]]},
		{"op":"_Mul","name":"4$88","attrs":{"__force_mirroring__":"True"},"inputs":[[97,0,0],[107,0,0]]},
		{"op":"FullyConnected","name":"4$89","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[108,0,0],[9,0,0]]},
		{"op":"_Plus","name":"4$90","attrs":{},"inputs":[[25,0,0],[109,0,0]]},
		{"op":"sigmoid","name":"4$91","attrs":{},"inputs":[[110,0,0]]},
		{"op":"FullyConnected","name":"4$92","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[108,0,0],[12,0,0]]},
		{"op":"_Plus","name":"4$93","attrs":{},"inputs":[[30,0,0],[112,0,0]]},
		{"op":"sigmoid","name":"4$94","attrs":{},"inputs":[[113,0,0]]},
		{"op":"FullyConnected","name":"4$95","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[108,0,0],[15,0,0]]},
		{"op":"_Plus","name":"4$96","attrs":{},"inputs":[[35,0,0],[115,0,0]]},
		{"op":"sigmoid","name":"4$97","attrs":{},"inputs":[[116,0,0]]},
		{"op":"FullyConnected","name":"4$98","attrs":{"num_hidden":"5","no_bias":"true"},"inputs":[[108,0,0],[18,0,0]]},
		{"op":"_Plus","name":"4$99","attrs":{},"inputs":[[40,0,0],[118,0,0]]},
		{"op":"tanh","name":"4$100","attrs":{},"inputs":[[119,0,0]]},
		{"op":"_Mul","name":"4$101","attrs":{"__force_mirroring__":"True"},"inputs":[[117,0,0],[106,0,0]]},
		{"op":"_Mul","name":"4$102","attrs":{"__force_mirroring__":"True"},"inputs":[[111,0,0],[120,0,0]]},
		{"op":"_Plus","name":"4$103","attrs":{"__force_mirroring__":"True"},"inputs":[[121,0,0],[122,0,0]]},
		{"op":"tanh","name":"4$104","attrs":{"__force_mirroring__":"True"},"inputs":[[123,0,0]]},
		{"op":"_Mul","name":"4$105","attrs":{"__force_mirroring__":"True"},"inputs":[[114,0,0],[124,0,0]]},
		{"op":"BlockGrad","name":"4.State","attrs":{},"inputs":[[125,0,0]]},
		{"op":"BlockGrad","name":"4.CellState","attrs":{},"inputs":[[123,0,0]]},
		{"op":"null","name":"5.Weights","attrs":{},"inputs":[]},
		{"op":"null","name":"5.Biases","attrs":{},"inputs":[]},
		{"op":"Concat","name":"5$0","attrs":{"num_args":"5","dim":"1"},"inputs":[[57,0,0],[74,0,0],[91,0,0],[108,0,0],[125,0,0]]},
		{"op":"Reshape","name":"5$1","attrs":{"shape":"(-1, 5, 5)"},"inputs":[[130,0,0]]},
		{"op":"Reshape","name":"5$2","attrs":{"shape":"(-1, 25)"},"inputs":[[131,0,0]]},
		{"op":"FullyConnected","name":"5$3","attrs":{"num_hidden":"3"},"inputs":[[132,0,0],[128,0,0],[129,0,0]]},
		{"op":"identity","name":"Output","attrs":{},"inputs":[[133,0,0]]}
	],
	"arg_nodes":[0,1,2,3,4,8,9,10,11,12,13,14,15,16,17,18,19,128,129],
	"heads":[
		[134,0,0],
		[126,0,0],
		[127,0,0]
	],
	"attrs":{
		"mxnet_version":["int",10001]
	}
}